app/views/shared/_images.html.erb

SELECT "categories".* FROM "categories"
---
    <td>
      <% if @category_array.map { |category| [category.id = image.category_id] } %>