app/controllers/categories_controller.rb

  def index
    @categories = Category.all #выбираем все элементы бд
---
SELECT "categories".* FROM "categories"

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "ccccccccc"], ["created_at", Thu, 20 Jun 2013 11:55:18 UTC +00:00], ["title", "eeeeeeee"], ["updated_at", Thu, 20 Jun 2013 11:55:18 UTC +00:00]]

  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "categories" SET "title" = 'World', "updated_at" = '2013-06-24 05:51:26.595207' WHERE "categories"."id" = 3