app/controllers/images_controller.rb

SELECT "images".* FROM "images"
SELECT "categories".* FROM "categories"
---
  def index
    @images = Image.all
    @category_array = Category.all

SELECT "categories".* FROM "categories"
---
  def new
    @image = Image.new
    @category_array = Category.all

SELECT "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "categories".* FROM "categories"
---
  def edit
    @image = Image.find(params[:id])
    @category_array = Category.all

SELECT "categories".* FROM "categories"
INSERT INTO "images" ("category_id", "created_at", "description", "image_url", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["category_id", nil], ["created_at", Fri, 21 Jun 2013 09:33:01 UTC +00:00], ["description", ""], ["image_url", ""], ["title", ""], ["updated_at", Fri, 21 Jun 2013 09:33:01 UTC +00:00]]
---
  def create
    @image = Image.new(params[:image])
    @category_array = Category.all

    respond_to do |format|
      if @image.save

SELECT "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "images" SET "category_id" = 1, "data_file_name" = '1234287818_cat_20.jpg', "data_file_size" = 48858, "data_updated_at" = '2013-06-25 06:02:57.216483', "updated_at" = '2013-06-25 06:02:57.602115' WHERE "images"."id" = 2
---
  def update
    @image = Image.find(params[:id])

    respond_to do |format|
      if @image.update_attributes(params[:image])