app/controllers/lists_controller.rb

  def index
    @category = Category.find_by_id(params[:category_id])
    @images = @category.images.all
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 3 LIMIT 1
SELECT "categories".* FROM "categories"
SELECT "images".* FROM "images" WHERE "images"."category_id" = 3