app/controllers/pictures_controller.rb

  def index
    @pics = Picture.all
---
SELECT "pictures".* FROM "pictures"

  def show
    unless @pic = Picture.where(id: params[:id]).first
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = 1 LIMIT 1

  def edit
    @pic = Picture.find(params[:id])
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    # короткая запись - создает/использует все переменые

    puts "++++"
    puts params[].inspect
    puts "++++"

    @pic = Picture.new(params[:picture])

    if @pic.save
---
INSERT INTO "pictures" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 20 Jun 2013 08:30:10 UTC +00:00], ["description", nil], ["title", nil], ["updated_at", Thu, 20 Jun 2013 08:30:10 UTC +00:00]]

  def update
    @pic = Picture.find(params[:id])
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", "11"]]