app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 25 Jun 2013 12:03:17 UTC +00:00], ["email", "mareev70@gmail.com"], ["name", "iww"], ["password", "ghbrjk"], ["updated_at", Tue, 25 Jun 2013 12:03:17 UTC +00:00]]
---
  def create
    @user = User.new(params[:user])
    if @user.save